2-densityFoam/testCase/Shu-Osher/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
1000
(
3.75061
3.75061
3.75061
3.75061
3.75061
3.75061
3.75061
3.75061
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 3.75061;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1.4752;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
