2-densityFoam/testCase/Shu-Osher/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1000
(
(2.62937 0 0)
(2.62937 0 0)
(2.62937 0 0)
(2.62937 0 0)
(2.62937 0 0)
(2.62937 0 0)
(2.62937 0 0)
(2.62937 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (2.62937 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
