2-densityFoam/testCase/Shu-Osher/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1000
(
10.3333
10.3333
10.3333
10.3333
10.3333
10.3333
10.3333
10.3333
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 10.3333;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
